#+TITLE: Getting started with wagtail-factories
#+OPTIONS: toc:nil
#+PROPERTY: header-args:python :python "uv run python" :session django :exports code
#+PROPERTY: header-args:bash :session shell

#+begin_src python :exports none :var root = (expand-file-name (project-root (project-current)))
  import os
  import django

  os.chdir(root)
  os.environ.setdefault("DJANGO_SETTINGS_MODULE", "tutorial.settings.dev")
  django.setup()
#+end_src

#+RESULTS:
: None


* Goals

In this tutorial, you will learn how to use the wagtail-factories library to create [[https://factoryboy.readthedocs.io/en/stable/][factory_boy]] factories for a Wagtail project. These factories facilitate the easy creation of model instances, which is particularly useful for tests. In this tutorial we'll learn about factories for Wagtail's models - stream field blocks will be covered in another document.

We assume working familiarity with Wagtail, and a passing familiarity with factory_boy.

* Page models

To get started, we'll create some basic page models. Wagtail gives us a ~HomePage~ model by default - we'll keep that.

#+begin_src python :eval no :tangle "../../home/models.py"
  from django.db import models
  from wagtail.models import Page


  class HomePage(Page):
      pass
#+end_src

Add a ~BlogPage~ type with an ~ImageField~, a ~TextField~, and a foreign key to Wagtail's ~Page~ model.

#+begin_src python :eval no :tangle "../../home/models.py"
  class BlogPage(Page):
      hero_image = models.ForeignKey(
          "wagtailimages.image",
          on_delete=models.PROTECT,
          related_name="+",
      )
      splash_text = models.TextField(blank=True)
      related_page = models.ForeignKey(
          Page,
          null=True,
          blank=True,
          on_delete=models.SET_NULL,
          related_name="related_pages",
      )
#+end_src

Create and run the migrations.

#+begin_src bash :exports none :var WORKDIR=(expand-file-name (project-root (project-current)))
  export DJANGO_SETTINGS_MODULE=tutorial.settings.dev
  cd $WORKDIR
#+end_src

#+RESULTS:

#+begin_src bash :results output :exports code
  uv run python manage.py makemigrations --noinput --no-color
  uv run python manage.py migrate --noinput --no-color
#+end_src

#+RESULTS:
#+begin_example
No changes detected
Operations to perform:
  Apply all migrations: admin, auth, contenttypes, home, sessions, taggit, wagtailadmin, wagtailcore, wagtaildocs, wagtailembeds, wagtailforms, wagtailimages, wagtailredirects, wagtailsearch, wagtailusers
Running migrations:
  Applying contenttypes.0001_initial... OK
  Applying auth.0001_initial... OK
  Applying admin.0001_initial... OK
  Applying admin.0002_logentry_remove_auto_add... OK
  Applying admin.0003_logentry_add_action_flag_choices... OK
  Applying contenttypes.0002_remove_content_type_name... OK
  Applying auth.0002_alter_permission_name_max_length... OK
  Applying auth.0003_alter_user_email_max_length... OK
  Applying auth.0004_alter_user_username_opts... OK
  Applying auth.0005_alter_user_last_login_null... OK
  Applying auth.0006_require_contenttypes_0002... OK
  Applying auth.0007_alter_validators_add_error_messages... OK
  Applying auth.0008_alter_user_username_max_length... OK
  Applying auth.0009_alter_user_last_name_max_length... OK
  Applying auth.0010_alter_group_name_max_length... OK
  Applying auth.0011_update_proxy_permissions... OK
  Applying auth.0012_alter_user_first_name_max_length... OK
  Applying wagtailcore.0001_squashed_0016_change_page_url_path_to_text_field... OK
  Applying wagtailcore.0017_change_edit_page_permission_description... OK
  Applying wagtailcore.0018_pagerevision_submitted_for_moderation_index... OK
  Applying wagtailcore.0019_verbose_names_cleanup... OK
  Applying wagtailcore.0020_add_index_on_page_first_published_at... OK
  Applying wagtailcore.0021_capitalizeverbose... OK
  Applying wagtailcore.0022_add_site_name... OK
  Applying wagtailcore.0023_alter_page_revision_on_delete_behaviour... OK
  Applying wagtailcore.0024_collection... OK
  Applying wagtailcore.0025_collection_initial_data... OK
  Applying wagtailcore.0026_group_collection_permission... OK
  Applying taggit.0001_initial... OK
  Applying wagtailimages.0001_squashed_0021... OK
  Applying wagtailimages.0022_uploadedimage... OK
  Applying wagtailadmin.0001_create_admin_access_permissions... OK
  Applying wagtailimages.0023_add_choose_permissions... OK
  Applying wagtailimages.0024_index_image_file_hash... OK
  Applying wagtailimages.0025_alter_image_file_alter_rendition_file... OK
  Applying wagtailimages.0026_delete_uploadedimage... OK
  Applying wagtailimages.0027_image_description... OK
  Applying wagtailcore.0027_fix_collection_path_collation... OK
  Applying wagtailcore.0024_alter_page_content_type_on_delete_behaviour... OK
  Applying wagtailcore.0028_merge... OK
  Applying wagtailcore.0029_unicode_slugfield_dj19... OK
  Applying wagtailcore.0030_index_on_pagerevision_created_at... OK
  Applying wagtailcore.0031_add_page_view_restriction_types... OK
  Applying wagtailcore.0032_add_bulk_delete_page_permission... OK
  Applying wagtailcore.0033_remove_golive_expiry_help_text... OK
  Applying wagtailcore.0034_page_live_revision... OK
  Applying wagtailcore.0035_page_last_published_at... OK
  Applying wagtailcore.0036_populate_page_last_published_at... OK
  Applying wagtailcore.0037_set_page_owner_editable... OK
  Applying wagtailcore.0038_make_first_published_at_editable... OK
  Applying wagtailcore.0039_collectionviewrestriction... OK
  Applying wagtailcore.0040_page_draft_title... OK
  Applying wagtailcore.0041_group_collection_permissions_verbose_name_plural... OK
  Applying wagtailcore.0042_index_on_pagerevision_approved_go_live_at... OK
  Applying wagtailcore.0043_lock_fields... OK
  Applying wagtailcore.0044_add_unlock_grouppagepermission... OK
  Applying wagtailcore.0045_assign_unlock_grouppagepermission... OK
  Applying wagtailcore.0046_site_name_remove_null... OK
  Applying wagtailcore.0047_add_workflow_models... OK
  Applying wagtailcore.0048_add_default_workflows... OK
  Applying wagtailcore.0049_taskstate_finished_by... OK
  Applying wagtailcore.0050_workflow_rejected_to_needs_changes... OK
  Applying wagtailcore.0051_taskstate_comment... OK
  Applying wagtailcore.0052_pagelogentry... OK
  Applying home.0001_initial... OK
  Applying home.0002_create_homepage... OK
  Applying wagtailcore.0053_locale_model... OK
  Applying wagtailcore.0054_initial_locale... OK
  Applying wagtailcore.0055_page_locale_fields... OK
  Applying wagtailcore.0056_page_locale_fields_populate... OK
  Applying wagtailcore.0057_page_locale_fields_notnull... OK
  Applying wagtailcore.0058_page_alias_of... OK
  Applying wagtailcore.0059_apply_collection_ordering... OK
  Applying wagtailcore.0060_fix_workflow_unique_constraint... OK
  Applying wagtailcore.0061_change_promote_tab_helpt_text_and_verbose_names... OK
  Applying wagtailcore.0062_comment_models_and_pagesubscription... OK
  Applying wagtailcore.0063_modellogentry... OK
  Applying wagtailcore.0064_log_timestamp_indexes... OK
  Applying wagtailcore.0065_log_entry_uuid... OK
  Applying wagtailcore.0066_collection_management_permissions... OK
  Applying wagtailcore.0067_alter_pagerevision_content_json... OK
  Applying wagtailcore.0068_log_entry_empty_object... OK
  Applying wagtailcore.0069_log_entry_jsonfield... OK
  Applying wagtailcore.0070_rename_pagerevision_revision... OK
  Applying wagtailcore.0071_populate_revision_content_type... OK
  Applying wagtailcore.0072_alter_revision_content_type_notnull... OK
  Applying wagtailcore.0073_page_latest_revision... OK
  Applying wagtailcore.0074_revision_object_str... OK
  Applying wagtailcore.0075_populate_latest_revision_and_revision_object_str... OK
  Applying wagtailcore.0076_modellogentry_revision... OK
  Applying wagtailcore.0077_alter_revision_user... OK
  Applying wagtailcore.0078_referenceindex... OK
  Applying wagtailcore.0079_rename_taskstate_page_revision... OK
  Applying wagtailcore.0080_generic_workflowstate... OK
  Applying wagtailcore.0081_populate_workflowstate_content_type... OK
  Applying wagtailcore.0082_alter_workflowstate_content_type_notnull... OK
  Applying wagtailcore.0083_workflowcontenttype... OK
  Applying wagtailcore.0084_add_default_page_permissions... OK
  Applying wagtailcore.0085_add_grouppagepermission_permission... OK
  Applying wagtailcore.0086_populate_grouppagepermission_permission... OK
  Applying wagtailcore.0087_alter_grouppagepermission_unique_together_and_more... OK
  Applying wagtailcore.0088_fix_log_entry_json_timestamps... OK
  Applying wagtailcore.0089_log_entry_data_json_null_to_object... OK
  Applying wagtailcore.0090_remove_grouppagepermission_permission_type... OK
  Applying wagtailcore.0091_remove_revision_submitted_for_moderation... OK
  Applying wagtailcore.0092_alter_collectionviewrestriction_password_and_more... OK
  Applying wagtailcore.0093_uploadedfile... OK
  Applying wagtailcore.0094_alter_page_locale... OK
  Applying wagtailcore.0095_groupsitepermission... OK
  Applying home.0003_blogpage... OK
  Applying sessions.0001_initial... OK
  Applying taggit.0002_auto_20150616_2121... OK
  Applying taggit.0003_taggeditem_add_unique_index... OK
  Applying taggit.0004_alter_taggeditem_content_type_alter_taggeditem_tag... OK
  Applying taggit.0005_auto_20220424_2025... OK
  Applying taggit.0006_rename_taggeditem_content_type_object_id_taggit_tagg_content_8fc721_idx... OK
  Applying wagtailadmin.0002_admin... OK
  Applying wagtailadmin.0003_admin_managed... OK
  Applying wagtailadmin.0004_editingsession... OK
  Applying wagtailadmin.0005_editingsession_is_editing... OK
  Applying wagtaildocs.0001_initial... OK
  Applying wagtaildocs.0002_initial_data... OK
  Applying wagtaildocs.0003_add_verbose_names... OK
  Applying wagtaildocs.0004_capitalizeverbose... OK
  Applying wagtaildocs.0005_document_collection... OK
  Applying wagtaildocs.0006_copy_document_permissions_to_collections... OK
  Applying wagtaildocs.0005_alter_uploaded_by_user_on_delete_action... OK
  Applying wagtaildocs.0007_merge... OK
  Applying wagtaildocs.0008_document_file_size... OK
  Applying wagtaildocs.0009_document_verbose_name_plural... OK
  Applying wagtaildocs.0010_document_file_hash... OK
  Applying wagtaildocs.0011_add_choose_permissions... OK
  Applying wagtaildocs.0012_uploadeddocument... OK
  Applying wagtaildocs.0013_delete_uploadeddocument... OK
  Applying wagtaildocs.0014_alter_document_file_size... OK
  Applying wagtailembeds.0001_initial... OK
  Applying wagtailembeds.0002_add_verbose_names... OK
  Applying wagtailembeds.0003_capitalizeverbose... OK
  Applying wagtailembeds.0004_embed_verbose_name_plural... OK
  Applying wagtailembeds.0005_specify_thumbnail_url_max_length... OK
  Applying wagtailembeds.0006_add_embed_hash... OK
  Applying wagtailembeds.0007_populate_hash... OK
  Applying wagtailembeds.0008_allow_long_urls... OK
  Applying wagtailembeds.0009_embed_cache_until... OK
  Applying wagtailforms.0001_initial... OK
  Applying wagtailforms.0002_add_verbose_names... OK
  Applying wagtailforms.0003_capitalizeverbose... OK
  Applying wagtailforms.0004_add_verbose_name_plural... OK
  Applying wagtailforms.0005_alter_formsubmission_form_data... OK
  Applying wagtailredirects.0001_initial... OK
  Applying wagtailredirects.0002_add_verbose_names... OK
  Applying wagtailredirects.0003_make_site_field_editable... OK
  Applying wagtailredirects.0004_set_unique_on_path_and_site... OK
  Applying wagtailredirects.0005_capitalizeverbose... OK
  Applying wagtailredirects.0006_redirect_increase_max_length... OK
  Applying wagtailredirects.0007_add_autocreate_fields... OK
  Applying wagtailredirects.0008_add_verbose_name_plural... OK
  Applying wagtailsearch.0001_initial... OK
  Applying wagtailsearch.0002_add_verbose_names... OK
  Applying wagtailsearch.0003_remove_editors_pick... OK
  Applying wagtailsearch.0004_querydailyhits_verbose_name_plural... OK
  Applying wagtailsearch.0005_create_indexentry... OK
  Applying wagtailsearch.0006_customise_indexentry... OK
  Applying wagtailsearch.0007_delete_editorspick... OK
  Applying wagtailsearch.0008_remove_query_and_querydailyhits_models... OK
  Applying wagtailsearch.0009_remove_ngram_autocomplete... OK
  Applying wagtailusers.0001_initial... OK
  Applying wagtailusers.0002_add_verbose_name_on_userprofile... OK
  Applying wagtailusers.0003_add_verbose_names... OK
  Applying wagtailusers.0004_capitalizeverbose... OK
  Applying wagtailusers.0005_make_related_name_wagtail_specific... OK
  Applying wagtailusers.0006_userprofile_prefered_language... OK
  Applying wagtailusers.0007_userprofile_current_time_zone... OK
  Applying wagtailusers.0008_userprofile_avatar... OK
  Applying wagtailusers.0009_userprofile_verbose_name_plural... OK
  Applying wagtailusers.0010_userprofile_updated_comments_notifications... OK
  Applying wagtailusers.0011_userprofile_dismissibles... OK
  Applying wagtailusers.0012_userprofile_theme... OK
  Applying wagtailusers.0013_userprofile_density... OK
  Applying wagtailusers.0014_userprofile_contrast... OK
  Applying wagtailusers.0015_userprofile_keyboard_shortcuts... OK
#+end_example

With some models created, we are ready to create the corresponding factory classes.

* Page factories

First, we'll create a factory for the ~HomePage~ type.

#+begin_src python :results value pp :tangle "../../home/factories.py"
  from wagtail_factories import PageFactory


  class HomePageFactory(PageFactory):
      pass
#+end_src

#+RESULTS:
: None

This one's simple. We can use it to create ~HomePage~ instances:

#+begin_src python :results value pp :exports both
  from home.factories import HomePageFactory

  HomePageFactory.build(title="My temporary home page")
#+end_src

#+RESULTS:
: <Page: My temporary home page>
